Tekla Open API Reference for Tekla Structures 2025
Integer Operators and Type Conversions
The Integer type exposes the following members.
Operators
Name | Description
Equality
 Compares an int value with a Datatype.Integer value.
Implicit(Int32 to Integer)
 Converts from int to Datatype.Integer.
Implicit(Integer to Int32)
 Converts from Datatype.Integer to int.
Inequality
 Compares an int value with a Datatype.Integer value.
Top
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace